<?php
/**
 * hbData
 * --------------------------------------------------------------------------------------------------
 * 版权所有 2016-
 * 网站地址:
 * --------------------------------------------------------------------------------------------------
 * Author: AlanJager
 * Release Date: 2016-7-4
 */

$_LANG['article_category'] = '文章中心';
$_LANG['article_tree'] = '文章分类';
$_LANG['article_news'] = '新闻中心';
$_LANG['article_more'] = '查看更多文章';
$_LANG['article_previous'] = '上一篇';
$_LANG['article_next'] = '下一篇';